OpenFOAM/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "1/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

18
(
    jetInlet
    {
        type            patch;
        nFaces          72;
        startFace       1131268;
    }
    inletATM
    {
        type            patch;
        nFaces          188;
        startFace       1131340;
    }
    jetTubeID
    {
        type            wall;
        inGroups        1(wall);
        nFaces          685;
        startFace       1131528;
    }
    jetTubeOD
    {
        type            wall;
        inGroups        1(wall);
        nFaces          466;
        startFace       1132213;
    }
    tubeID
    {
        type            wall;
        inGroups        1(wall);
        nFaces          898;
        startFace       1132679;
    }
    tubeOD
    {
        type            wall;
        inGroups        1(wall);
        nFaces          815;
        startFace       1133577;
    }
    farfieldATM
    {
        type            patch;
        nFaces          485;
        startFace       1134392;
    }
    outletATM
    {
        type            patch;
        nFaces          20;
        startFace       1134877;
    }
    sym1
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          576107;
        startFace       1134897;
    }
    sym2
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          576107;
        startFace       1711004;
    }
    jetOutlet_intA
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          72;
        startFace       2287111;
        matchTolerance  0.001;
        transform       noOrdering;
        neighbourPatch  jetOutlet_intB;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }
    jetOutlet_intB
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          72;
        startFace       2287183;
        matchTolerance  0.001;
        transform       noOrdering;
        neighbourPatch  jetOutlet_intA;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }
    tubeInlet_intA
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          176;
        startFace       2287255;
        matchTolerance  0.001;
        transform       noOrdering;
        neighbourPatch  tubeInlet_intB;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }
    tubeInlet_intB
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          176;
        startFace       2287431;
        matchTolerance  0.001;
        transform       noOrdering;
        neighbourPatch  tubeInlet_intA;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }
    tubeOutlet_intA
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          338;
        startFace       2287607;
        matchTolerance  0.001;
        transform       noOrdering;
        neighbourPatch  tubeOutlet_intB;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }
    tubeOutlet_intB
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          338;
        startFace       2287945;
        matchTolerance  0.001;
        transform       noOrdering;
        neighbourPatch  tubeOutlet_intA;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }
    jetCore_intA
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          338;
        startFace       2288283;
        matchTolerance  0.001;
        transform       noOrdering;
        neighbourPatch  jetCore_intB;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }
    jetCore_intB
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          338;
        startFace       2288621;
        matchTolerance  0.001;
        transform       noOrdering;
        neighbourPatch  jetCore_intA;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }
)

// ************************************************************************* //
