OpenFOAM/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       sutherland; //const, sutherland
    thermo          janaf;      //hConst, janaf
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

// Air

mixture
{
    specie
    {
        molWeight       28.85;
    }
    thermodynamics
    {
        //hconst thermo model
        Cp              1004.5;
        Hf              2.544e+06;

        //janaf thermo model
        Tlow            90;
        Thigh           3000;
        Tcommon         1000;
        highCpCoeffs     (2.71826605 0.002065342 -1.03795E-06 2.54097E-10 -2.42429E-14 625.1883817 -2.379299109);
        lowCpCoeffs    (3.837714658	-0.002905058 7.83212E-06 -7.25244E-09 2.47047E-12 414.1800335 -7.473283008);
    }
    transport
    {
        //const transport model
        mu              1.754e-5;
        Pr              0.735;

        //sutherland transport model
        As              1.4568e-06;
        Ts              110;
    }
}


// ************************************************************************* //
