OpenFOAM/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform 87539.3;

boundaryField
{
    jetInlet
    {
        type            totalPressure;
        rho             rho;
        psi             thermo:psi;
        gamma           1.4;
        p0              uniform 227500;
        value           uniform 227500;
    }
    inletATM
    {
        type            totalPressure;
        rho             rho;
        psi             thermo:psi;
        gamma           1.4;
        p0              uniform 89000;
        value           uniform 89000;
    }
    jetTubeID
    {
        type            zeroGradient;
    }
    jetTubeOD
    {
        type            zeroGradient;
    }
    tubeID
    {
        type            zeroGradient;
    }
    tubeOD
    {
        type            zeroGradient;
    }
    farfieldATM
    {
        type            totalPressure;
        rho             rho;
        psi             thermo:psi;
        gamma           1.4;
        p0              uniform 89000;
        value           uniform 89000;
    }
    outletATM
    {
        type            fixedValue;
        value           uniform 89000;
    }
    sym1
    {
        type            symmetry;
    }
    sym2
    {
        type            symmetry;
    }
    jetOutlet_intA
    {
        type            cyclicAMI;
        value           uniform 227500;
    }
    jetOutlet_intB
    {
        type            cyclicAMI;
        value           uniform 227500;
    }
    tubeInlet_intA
    {
        type            cyclicAMI;
        value           uniform 89000;
    }
    tubeInlet_intB
    {
        type            cyclicAMI;
        value           uniform 89000;
    }
    tubeOutlet_intA
    {
        type            cyclicAMI;
        value           uniform 89000;
    }
    tubeOutlet_intB
    {
        type            cyclicAMI;
        value           uniform 89000;
    }
    jetCore_intA
    {
        type            cyclicAMI;
        value           uniform 227500;
    }
    jetCore_intB
    {
        type            cyclicAMI;
        value           uniform 227500;
    }
}


// ************************************************************************* //
