OpenFOAM/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];


internalField   uniform 296;

boundaryField
{
    jetInlet
    {
        type            totalTemperature;
        gamma           1.4;
        T0              uniform 295;
        value           uniform 295;
    }
    inletATM
    {
        type            totalTemperature;
        gamma           1.4;
        T0              uniform 291;
        value           uniform 291;
    }
    jetTubeID
    {
        type            zeroGradient;
    }
    jetTubeOD
    {
        type            zeroGradient;
    }
    tubeID
    {
        type            zeroGradient;
    }
    tubeOD
    {
        type            zeroGradient;
    }
    farfieldATM
    {
        type            totalTemperature;
        gamma           1.4;
        T0              uniform 291;
        value           uniform 291;
    }
    outletATM
    {
        type            zeroGradient;
    }
    sym1
    {
        type            symmetry;
    }
    sym2
    {
        type            symmetry;
    }
    jetOutlet_intA
    {
        type            cyclicAMI;
        value           uniform 295;
    }
    jetOutlet_intB
    {
        type            cyclicAMI;
        value           uniform 295;
    }
    tubeInlet_intA
    {
        type            cyclicAMI;
        value           uniform 295;
    }
    tubeInlet_intB
    {
        type            cyclicAMI;
        value           uniform 295;
    }
    tubeOutlet_intA
    {
        type            cyclicAMI;
        value           uniform 295;
    }
    tubeOutlet_intB
    {
        type            cyclicAMI;
        value           uniform 295;
    }
    jetCore_intA
    {
        type            cyclicAMI;
        value           uniform 295;
    }
    jetCore_intB
    {
        type            cyclicAMI;
        value           uniform 295;
    }
}


// ************************************************************************* //
