OpenFOAM/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 1e-05;

boundaryField
{
    jetInlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.02;
        value           uniform 1;
    }
    inletATM
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.005;
        value           uniform 1;
    }
    jetTubeID
    {
        type            kLowReWallFunction;
        value           uniform 0;
    }
    jetTubeOD
    {
        type            kLowReWallFunction;
        value           uniform 0;
    }
    tubeID
    {
        type            kLowReWallFunction;
        value           uniform 0;
    }
    tubeOD
    {
        type            kLowReWallFunction;
        value           uniform 0;
    }
    farfieldATM
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.005;
        value           uniform 1;
    }
    outletATM
    {
        type            zeroGradient;
    }
    sym1
    {
        type            symmetry;
    }
    sym2
    {
        type            symmetry;
    }
    jetOutlet_intA
    {
        type            cyclicAMI;
        value           uniform 1;
    }
    jetOutlet_intB
    {
        type            cyclicAMI;
        value           uniform 1;
    }
    tubeInlet_intA
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    tubeInlet_intB
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    tubeOutlet_intA
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    tubeOutlet_intB
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    jetCore_intA
    {
        type            cyclicAMI;
        value           uniform 1;
    }
    jetCore_intB
    {
        type            cyclicAMI;
        value           uniform 1;
    }
}


// ************************************************************************* //
