OpenFOAM/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   uniform 1e-08;

boundaryField
{
    jetInlet
    {
        type            calculated;
        value           uniform 0;
    }
    inletATM
    {
        type            calculated;
        value           uniform 0;
    }
    jetTubeID
    {
        type            nutkRoughWallFunction;
        Ks              uniform 1.5e-06;
        Cs              uniform 0.5;
        value           uniform 0;
    }
    jetTubeOD
    {
        type            nutkRoughWallFunction;
        Ks              uniform 1.5e-06;
        Cs              uniform 0.5;
        value           uniform 0;
    }
    tubeID
    {
        type            nutkRoughWallFunction;
        Ks              uniform 1.5e-06;
        Cs              uniform 0.5;
        value           uniform 0;
    }
    tubeOD
    {
        type            nutkRoughWallFunction;
        Ks              uniform 1.5e-06;
        Cs              uniform 0.5;
        value           uniform 0;
    }
    farfieldATM
    {
        type            calculated;
        value           uniform 0;
    }
    outletATM
    {
        type            calculated;
        value           uniform 0;
    }
    sym1
    {
        type            symmetry;
    }
    sym2
    {
        type            symmetry;
    }
    jetOutlet_intA
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    jetOutlet_intB
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    tubeInlet_intA
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    tubeInlet_intB
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    tubeOutlet_intA
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    tubeOutlet_intB
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    jetCore_intA
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    jetCore_intB
    {
        type            cyclicAMI;
        value           uniform 0;
    }
}


// ************************************************************************* //
