OpenFOAM/system/MachNo
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the Mach Number field from the velocity field.

\*---------------------------------------------------------------------------*/

type            MachNo;
libs            ("libfieldFunctionObjects.so");

field           U;

executeControl		timeStep;
executeInterval		1;
writeControl		writeTime;

// ************************************************************************* //
