OpenFOAM/system/Min
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out the minimum cell value for one or more fields.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/minMax/cellMin.cfg"

fields (T rho p);

// ************************************************************************* //
