OpenFOAM/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

// decomposeParDict created at Mon Oct 31 10:01:35 MDT 2022.

numberOfSubdomains 624;

method          scotch;

