OpenFOAM/system/probe1425c
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (k Ma p T rho U UMean UPrime2Mean omega turbulenceProperties:epsilon turbulenceProperties:R);
probeLocations
(
    (0.42575 0.019047 0.0008316)
);

// ************************************************************************* //
