OpenFOAM/system/turbulenceFields
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2012
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates specified turbulence fields, specifically the Reynolds Stress Tensor,  and stores it on the database.

\*---------------------------------------------------------------------------*/

type            turbulenceFields;
libs            ("libfieldFunctionObjects.so");

fields          (R epsilon);

executeControl		timeStep;
executeInterval		1;
writeControl    	writeTime;

// ************************************************************************* //

